typedef struct {
    short left;	       /* Lch */
    short right;       /* Rch */
} SpuVolume;

// Differs from standart psyq
typedef struct {
    unsigned long   voice_id;       // +0x00 id of voice
    unsigned long   mask;           // +0x04 settings attribute bit (invalid with Get)
    unsigned long   addr;           // +0x08 waveform data start address
    unsigned long   loop_addr;      // +0x0c loop start address
    unsigned short  pitch;          // +0x10 tone (pitch setting)
    unsigned short  adsr1;          // +0x12 adsr1 for `VagAtr'
    unsigned short  adsr2;          // +0x14 adsr2 for `VagAtr'
    unsigned short  volmode;        // +0x16 volume mode
    SpuVolume       volume;         // +0x18 volume
} SpuVoiceAttr;

#define	SPU_VOICE_DIRECT        0
#define	SPU_VOICE_LINEARIncN    1
#define	SPU_VOICE_LINEARIncR    2
#define	SPU_VOICE_LINEARDecN    3
#define	SPU_VOICE_LINEARDecR    4
#define	SPU_VOICE_EXPIncN       5
#define	SPU_VOICE_EXPIncR       6
#define	SPU_VOICE_EXPDec        7
#define	SPU_VOICE_EXPDecN       SPU_VOICE_EXPDec
#define	SPU_VOICE_EXPDecR       SPU_VOICE_EXPDec

#define	SPU_VOICE_VOLL          (0x01 <<  0) /* volume (left) */
#define	SPU_VOICE_VOLR          (0x01 <<  1) /* volume (right) */
#define	SPU_VOICE_VOLMODEL      (0x01 <<  2) /* volume mode (left) */
#define	SPU_VOICE_VOLMODER      (0x01 <<  3) /* volume mode (right) */
#define	SPU_VOICE_PITCH         (0x01 <<  4) /* tone (pitch setting) */
#define	SPU_VOICE_NOTE          (0x01 <<  5) /* tone (note setting)  */
#define	SPU_VOICE_SAMPLE_NOTE   (0x01 <<  6) /* waveform data sample note */
